### Splunk queries  https://www.splunk.com/pdfs/solution-guides/splunk-quick-reference-guide.pdf or https://docs.splunk.com/Documentation/Splunk/8.1.0/SearchReference/Stats

# List indexes
| eventcount summarize=false index=* index=_* | dedup index | fields index
| tstats count WHERE index=* by index | table index
| tstats count where index=zscaler sourcetype=zscalernss-web by _time span=1d
| tstats count where index=zscaler sourcetype=zscalernss-web by _time span=7d
| tstats count WHERE index=* by sourcetype,_time span=1d prestats=t |  timechart span=1d count by sourcetype   (visualization: line chart)
| tstats count WHERE index=rapid7 by sourcetype,_time span=1d prestats=t |  timechart span=1d count by sourcetype


# Index health
| tstats count where index=zscaler sourcetype=zscalernss-web by _time span=1d


index=* "*first.last@company.com*" | stats count by sourcetype

index="<index>" | spath <field to be searched> | search <field to be searched>="*<value>*" | table <field(s) to be displayed>


index="rapid7" ip="10.11.12.13" | table ip, host, severity, signature, signature_id, first_discovered, most_recently_discovered
index="qualys" ip="10.11.12.13" | table ip, hostname, severity, title, qid, first_found, last_found

# Show count of users who accessed github.com each day, and list users by name
index="zscaler" sourcetype="zscalernss-web" dest="*.github.com*" | dedup user | sort user | timechart span=1d count(user) as total_users
index="zscaler" sourcetype="zscalernss-web" dest="*.github.com*" | dedup user | sort user | table user


index="rapid7" | stats values(ip) as src_ip dc(ip) as distinctCountIP
index="rapid7" ip=* | table ip, hostname, os | sort hostname
index="rapid7" infoblox_city=* | table infoblox_city | dedup infoblox_city


index="rapid7" ip=* os="*Windows 10*" | table ip, hostname, os, severe_vulnerabilities, vulnerabilities | dedup ip

index="rapid7" ip=* os="*Windows 10*" | stats avg(severe_vulnerabilities)


index=rapid7 sourcetype="rapid7:nexpose:asset" |stats count by nexpose_tags | rex field=nexpose_tags "((?<junk>\w+);.*;(?<OS>.*))"| table nexpose_tags OS | stats count by OS| search OS="*-*"
